---
kind: type
id: T:Autodesk.Revit.DB.SlabShapeVertexType
source: html/c4ee94bf-b5c2-df94-04c5-5893c9cbdb1a.htm
---
# Autodesk.Revit.DB.SlabShapeVertexType

The type of a SlabShapeVertex

## Syntax (C#)
```csharp
public enum SlabShapeVertexType
```